{"posts":[{"title":"निशान राई","text":"About MeHi, I’m Nishan Rai — a passionate graduate student in Computer Science at New Mexico State University (NMSU), where I work as a Graduate Assistant and Teaching Assistant. My academic and research interests lie at the intersection of Artificial Intelligence, Natural Language Processing, and Computer Vision. My recent work includes developing unified tumor segmentation pipelines using medical imaging datasets, and constructing custom compilers that translate high-level code into optimized x86-64 assembly. Research Interests Artificial Intelligence &amp; Deep Learning Natural Language Processing (NLP) Mathematical Language Models Medical Image Segmentation Compiler and Systems Design Featured Projects Unified Tumor Segmentation: MRI/CT-based multi-modal segmentation using Attention U-Net Custom Compilers: Built a recursive-descent compiler with support for control flow, expressions, and code generation targeting x86-64 assembly. Used tools like lex and yacc. Lung Cancer Detection using CNNDeveloped and evaluated CNN-based models using TensorFlow and PyTorch to improve diagnostic accuracy. Benchmarked against VGG16, ResNet50, and InceptionV3, with SHAP interpretability.View Project Report IoT-Based Irrigation SystemDesigned an IoT system with NodeMCU, soil/moisture sensors, MongoDB, and a React Native app. Achieved 20% water savings via smart scheduling.View Project Report Skills &amp; Tools Languages: Python, C, C++, SQL, JavaScript Frameworks: PyTorch, TensorFlow, FastAPI Tools: Jupyter, Tableau, Streamlit, Cascade CMS, Slate CRM Other: Git, Linux, Assembly, NLP, Deep Learning Connect with Me GitHub LinkedIn ResearchGate ✨ I’ll be sharing technical blogs, research updates, and open-source projects — stay tuned!","link":"/2025/07/17/Welcome-to-My-Blog/"}],"tags":[],"categories":[],"pages":[{"title":"About Me","text":"","link":"/about/index.html"},{"title":"Home","text":"👋 Welcome!I’m Nishan Rai, a graduate student passionate about AI, research, and software development. 🧠 Research: Transformer Models, MathBERT💻 Projects: Compiler, Tumor Segmentation, Personal Website📬 Contact Me","link":"/index/index.html"}]}